[
    {
      "_id": "624ac19dc0017dec89f8198a",
      "balance": "$2,416.95",
      "name": "Barlow Sharp",
      "email": "barlowsharp@furnafix.com",
      "article": "React context is great when you are passing data that can be used in any component in your application. context api solve props drilling problem its amazing. when you pass data multiple labels to a nested component. then you use context api. use context api easily pass data parent component to child component. Finally I can say context api assists in solving prop-drilling from all levels of your application.",
      "title": "what is purpose of context api ?"
    },
    {
      "_id": "624ac19da975a71059e0a323",
      "balance": "$1,897.21",
      "name": "Tillman Hart",
      "email": "tillmanhart@furnafix.com",
      "article": "Semantic HTML elements are those that clearly describe their meaning in a human- and machine-readable way.By creating standard semantic element, it makes to easier understand a developer. using semantic element, you can help the browser for understand the meaning of the content instead of just displaying it. HTML5 semantic elements also help search engines to read the page and find the required information faster",
      "title": "what is Semantic tag"
    },
    {
      "_id": "624ac19dc2b18d2c02d06a3a",
      "balance": "$1,786.75",
      "name": "Fay Christian",
      "email": "faychristian@furnafix.com",
      "article": "This is The major difference between block and inline element. Inline elements: Inline elements occupy only enough width that is sufficient. he is allows other elements next to it which are inline. Inline elements don’t start from a new line he started same line. and don’t have top and bottom margins as like block elements have. Block elements: They consume the entire width available irrespective of their sufficiency. block element always start in a new line and they have margin top and bottom. block element always create a new line",
      "title": "What is difference between inline and block element?"
    }
  ]